[
    {
      "image": "https://ccc-server.ewubd.edu/uploads/images/club/bn0mKlpJk3_64916caaae45e.png",
      "clubName": "Photography Club",
      "club": "EWUPC",
      "email": "ewupc@gmail.com",
      "clubMember": 157,
      "establish": 2001,
      "clubVision": "Making students more aware of all dimensions of Photography.  The club motivates students to learn and share new ideas and techniques with fellows with similar interest and imaginative power through photography. East West University Photography Club has arranged and participated in several national and international exhibitions and won prizes in different categories. EWUCPC turned into EWUPC in 31th August, 2010.",
      "status": "active"
    },
  {
      "image": "https://www.ewubd.edu/themes/east-west-university/assets/default/images/clubs/Agro.jpg",
      "clubName": " Agro-Industrialization Club",
      "club": "EWUAIC",
      "email": "ewuaic@gmail.com",
      "clubMember": 145,
      "establish": 2021,
      "clubVision": "Agro Industrialization Club of East West University(EWUAIC), established on April 1, 2011, is the first initiative among the private universities of Bangladesh to represent the process of industrialization of agro products and to uphold our agricultural economy globally.From the time immemorial to till now, Bangladesh has been the agriculturally privileged country in the world and agriculture is the most important and inevitable sector of Bangladesh.We believe that the private sector can also play a significant role in our agricultural economy to keep pace with the competitive world along with the public sectors. And EWUAIC is performing this role proudly. EWUAIC holds 4 flagship events- EWU MarquePrey, EWU Supply Chain Challenge, EWU Agro Biz Expo, EWU Value String Challenge and has successfully completed 26 events. This club basically encompasses the people, ideas, attempts and resources all together to do agricultural products and service branding, innovation and industrialization through research and different types of activity performances. We always want everyone should have a transparent knowledge about how to make the best utilization of our agro products and their supply chain so that Farmers and our economy can be mostly benefited.",
      "status": "active"
      
    },
  {
      "image": "https://www.ewubd.edu/themes/east-west-university/assets/default/images/clubs/BC-logo-696x458.png",
      "clubName": "Business Club",
      "club": "EWUBC",
      "email": "ewubc@gmail.com",
      "clubMember": 155,
      "establish": 1999,
      "clubVision": "East West University Business Club(EWUBC) is the first club of the university with the aim to promote leadership and entrepreneurship of dexterous students. The club works with the all phases of business to practice and determine management skills under the intellectual supervision of spotlessly competent moderators. Since 1999, EWUBC has been putting efforts for students to practice creativity, teamwork, leadership, idea sharing and so much more.EWUBC functions on grooming programs for students about presentation skill development, Microsoft Excel, career talk, business competitions etc. EWUBC appreciates students by organizing many events, seminars and competitions.The significant events of East West University Business Club are Inter University Business Plan Competition 2017, Power Presenter, Microsoft Excel Training Program, Career Clinic, Competition Courses, BriefCase (an Intra University Business Sales Competition). EWUBC also set up yearly expeditions for its members and university students.",
      "status": "active"
      
    },
  {
      "image": "https://www.ewubd.edu/themes/east-west-university/assets/default/images/clubs/Marketing-Club.jpg",
      "clubName": "Creative Marketing Club",
      "club": "EWUCMC",
      "email": "ewucmc@gmail.com",
      "clubMember": 140,
      "establish": 2006,
      "clubVision": "East West University Creative Marketing Club is the Nation's First-Ever Marketing Club of the country with the motto Communicate to Learn”. The club started its voyage on 13th April 2006 with the vision to create future marketeers and marketing leaders. In 14 years of glory, East West University Creative Marketing Club has taken many timely initiatives and activities. The club focuses on preparing all its members for the upcoming challenges by giving them a sense of hierarchy, coordination, communication, teamwork, and professionalism.Marketing Icon, Share of Mind, Creative Fiesta, DIGITS, STEPS, Creative Carnival Series, Photoshop 101 and 102, Service Combat Series & Learning Fest Series are some of the biggest events that were arranged by East West University Creative Marketing Club (EWUCMC) that received great praises and success. However, the gem to flaunt is “Analytics 2017- Nation’s First Ever Inter University Digital Marketing Competition which is also the flagship event of EWUCMC. With the participation of around 100 teams from 40 different universities from all around the country, and with the association of leading corporate leaders the event turned out to be a great success. The valiant efforts of the club executives alongside an enthusiastic organizing team led the event to a glorious end in December 2017 with its sequel East West University Creative Marketing club organized the nation’s biggest digital marketing competition Analytics 2.0 at 2021.Furthermore, in the time of COVID-19 pandemic, East West University Creative Marketing Club came up with initiatives that helped the students to adapt to the new normal. The following events that were virtually organized are as follows: Corporate Talks, Meeting of Minds, Marketing Summit 2020, Succeed With Supply Chain, Analytics 2.0.In conclusion, EWUCMC has always believed in setting benchmarks that would inspire the future leaders to take another step forward, to be more and do more.",
      "status": "active"
      
    },
  
  {
      "image": "https://www.ewubd.edu/storage/app/media/Clubs/ComputerPC/EWUCoPC-logo1.jpg",
      "clubName": "Computer Programming Club",
      "club": "EWUCoPC",
      "email": "ewucopc@gmail.com",
      "clubMember": 165,
      "establish": 2016,
      "clubVision": "East-West University Computer Programming Club (EWUCoPC) helps to improve Computer programming skills and this club is also inviting them who are interested in computer programming from any department of EWU to be a member. It also organize Programing Contest, seminars and various kinds of workshops to enhance the skills of the EWU students.",
      "status": "active"
      
    },
  
  {
      "image": "https://www.ewubd.edu/themes/east-west-university/assets/default/images/clubs/ECPA.jpg",
      "clubName": "Performing Arts Club",
      "club": "ECPA",
      "email": "ewuecpa@gmail.com",
      "clubMember": 170,
      "establish": 2009,
      "clubVision": "Since its inception, ECPA has built a reputation by successfully organizing some big events at the university premises even outside. ECPA got some talented and dedicated members including musicians, singers,actor/actress, reciters, dancers, designers and organizers who uphold the club with creativity & passion.Our Mission: Promoting Bangladeshi Culture and Recognizing Meaningful International Cultures.Our Slogan: We Perform With Attitude",
      "status": "active"
      
    },
  
  {
      "image": "https://www.ewubd.edu/storage/app/media/logo/ewuec.png",
      "clubName": "Economics Club",
      "club": "EWUEC",
      "email": "ewuec@gmail.com",
      "clubMember": 135,
      "establish": 2015,
      "clubVision": "East West University Economics Club, established in 2015, aims to provide a platform for all the students of East West University, irrespective of the department, where they can gain real-life experience and develop skills that will elevate them in terms of academic and professional stages. The club focuses on developing its members' soft skills, leadership, and communication skills by arranging seminars, competitions, and workshops. It envisions to instill values beyond the bookish knowledge, which will enable them to create a better tomorrow. Every semester the students are recruited through a systematic process, and the membership is available to all the students of East West University.",
      "status": "active"
      
    },
  
  {
      "image": "https://www.ewubd.edu/storage/app/media/Clubs/Robotics%20Club/Robotics-Club-Logo.jpg",
      "clubName": "Robotics Club",
      "club": "EWURC",
      "email": "ewurc@gmail.com",
      "clubMember": 160,
      "establish": 2001,
      "clubVision": "EWU Robotics Club is the robotics platform of East West University. We believe knowledge has no boundaries. The aims of the club are to introduce students with robotics and enrich their knowledge of new technologies, arrange training session on these technologies through semester long skill developments courses, apply this technical understanding to make innovative projects and implicate them in real life, and also apply them to conduct world class research and innovation.",
      "status": "active"
      
    },
   
  ]